#### Friction Property

---

|  |
| --- |
| PipePressureDropData Class   See Also |

The friction of the pipe. Units: (kg/(ftÂ²Â·sÂ²)).

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double Friction { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Friction As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Friction { 	double get (); 	void set (double value); } ``` |

# See Also

PipePressureDropData Class

Autodesk.Revit.DB.Plumbing Namespace